Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །མཚན་མ་མེད་པའི་རྣམ་པར་ཐར་པའི་སྒོ་བཟུང་སྟེ་བསྒོམས་ན་དེ་ལས་གཞན་པའི་སྤྱོད་ཡུལ་དང་བྲལ་བས་མཚན་མ་མེད་པའི་སྤྱོད་ཡུལ་དུ་འགྱུར་རོ།
en: When they have thus taken up in meditation the signlessness gateway to liberation, they are free from any other experiential domain, so their range is the signless.

source: །དེས་སྨོན་པ་མེད་པའི་བདག་ཉིད་དུ་མཐོང་ན་ཁམས་གསུམ་ལ་སྨོན་དུ་རུང་བར་རྟོག་པར་མི་བྱེད་དོ།
en: When they see the three realms as do those who have no wishes, they do not fashion the three realms as worth wishing for.

source: །དེ་བས་ན་སྟོང་པ་ཉིད་ལ་གནས་པ། མཚན་མ་མེད་པ་སྤྱོད་ཡུལ་པ། མ་བརྟགས་པའི་སྨོན་ལམ་དང་ལྡན་པ་ཞེས་བྱ་བའོ།
en: Thus, they are dwellers in emptiness, their range the signless, and who had not fashioned any wishes.

source: །དེ་ལྟར་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་གྱི་ཏིང་ངེ་འཛིན་དག་ལ་ལེགས་པར་གནས་པ་དེ་སྤྲོས་པ་ཐམས་ཅད་ཉེ་བར་ཞི་བའི་ཕྱིར་མཉམ་པ་ཉིད་ཀྱི་བཟོད་པ་བཞི་འབྱུང་བར་འགྱུར་ཏེ།
en: Those who thus dwell well in the meditative stabilizations that are the gateways to liberation calm all elaborations, so for them four types of forbearance for sameness come about.

source: བདག་དང་གཞན་དུ་རྣམ་པར་རྟོག་པ་མེད་པའི་ཕྱིར་སེམས་ཅན་ལ་མཉམ་པ་ཉིད་ཀྱི་བཟོད་པ་དང་། རྗེས་སུ་ཆགས་པ་དང་ཁོང་ཁྲོ་བ་མེད་པའི་ཕྱིར་འདུ་བྱེད་ལ་མཉམ་པ་ཉིད་ཀྱི་བཟོད་པ་དང་། དེ་བཞིན་ཉིད་ཙམ་དུ་ཟད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ལ་མཉམ་པ་ཉིད་ཀྱི་བཟོད་པ་དང་། འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་ལ་སེམས་མཉམ་པའི་ཕྱིར་མི་གནས་པ་མཉམ་པ་ཉིད་ཀྱི་བཟོད་པའོ། །དེ་ལྟར་དེས་མཉམ་པ་ཉིད་ཀྱི་བཟོད་པ་བཞི་བསྐྱེད་ནས་ཡོངས་སུ་འདྲིས་པར་བྱས་པའི་ཕྱིར་ས་བཅུ་པ་ལས་བཤད་པའི་རིམ་པ་བཞིན་དུ་གཞན་ཡང་མཉམ་པ་ཉིད་བཅུ་འབྱུང་སྟེ། འདི་ལྟ་སྟེ། མཚན་མ་མེད་པར་མཉམ་པ་ཉིད་དང་། མཚན་ཉིད་མེད་པར་མཉམ་པ་ཉིད་དང་། མ་སྐྱེས་པར་མཉམ་པ་ཉིད་དང་། འབྱུང་བ་མེད་པར་མཉམ་པ་ཉིད་དང་། དབེན་པར་མཉམ་པ་ཉིད་དང་།
en: They have no conception of self and other, so they have forbearance for self and others being the same; they have no attachment or aversion, so they have forbearance for compounded phenomena being the same; because they are nothing more than suchness, they have forbearance for all phenomena being the same; and because they think nirvāṇa and saṃsāra are the same, they have forbearance for nonabiding sameness.

source: གཟོད་མ་ནས་ཞི་བར་མཉམ་པ་ཉིད་དང་། སྤྲོས་པ་མེད་པར་མཉམ་པ་ཉིད་དང་། བླང་བ་མེད་པ་དང་དོར་བ་མེད་པར་མཉམ་པ་ཉིད་དང་། སྒྱུ་མ་དང་། རྨི་ལམ་དང་། མིག་ཡོར་དང་། བྲག་ཅ་དང་། ཆུ་ཟླ་དང་། གཟུགས་བརྙན་དང་།
en: From having thus produced and become habituated to the four forbearances for sameness, ten further samenesses gradually, as explained in The Ten Bhūmis, occur: signless sameness; markless sameness; unproduced sameness; unoriginated sameness; isolated sameness; calm-from-the-beginning sameness; unelaborated sameness; no forsaking or appropriating sameness; sameness as an illusion, a dream, an apparition, an echo, the reflection of the moon in water, a reflection in a mirror, or a magical creation; and existent and nonexistent sameness.

source: སྤྲུལ་པར་མཉམ་པ་ཉིད་དང་། དངོས་པོ་དང་དངོས་པོ་མེད་པ་ཉིད་མཉམ་པ་ཉིད་དོ། །ཀུན་བརྟགས་པའི་རྣམ་པ་དང་བྲལ་བ་སྤྲོས་པ་མེད་པའི་ཆོས་ཀྱི་དབྱིངས་གང་ཡིན་པ་དེ་ནི་མཚན་མ་དང་བཅས་པ་ཐམས་ཅད་དང་། རྣམ་པར་རྟོག་པ་དང་བཅས་པའི་རྣམ་པར་ཤེས་པ་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་མ་ཡིན་གྱི་རྣམ་པར་མི་རྟོག་པའི་ཡེ་ཤེས་ཉིད་ཀྱི་སྤྱོད་ཡུལ་ཡིན་ཏེ།
en: The unelaborated dharma-constituent free from imaginary aspects is not within the range of any consciousness with causal signs or conceptualization; it is within the range of nonconceptual knowledge.

source: དེའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མཚན་མ་མེད་པ་ཞེས་བྱའོ།
en: Hence all dharmas are said to be signless.

source: །དེ་ལྟ་བས་ན་ཡོངས་སུ་གྲུབ་པའི་བདག་ཉིད་ཀྱིས་ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པར་མཉམ་པ་ཉིད་དོ། །ཀུན་བརྟགས་པའི་ཆོས་བརྗོད་པར་བྱ་བ་དང་། རྗོད་པར་བྱེད་པ་དང་།
en: Therefore, because all phenomena have the thoroughly established for their nature, there is signless sameness.

source: གཟུང་བ་དང་འཛིན་པའི་རྣམ་པའི་ཆོས་གང་དག་ཡིན་པ་དེ་དག་ཐམས་ཅད་ནི་ཤིན་ཏུ་མེད་པའི་ཕྱིར་ཀུན་བརྟགས་པའི་མཚན་ཉིད་དེས་མཚན་ཉིད་མེད་དེ་དེ་བས་ན་མཚན་ཉིད་མེད་པར་མཉམ་པ་ཉིད་ཅེས་བྱའོ།
en: Imaginary phenomena in the form of language and subject matter, the subject as the one who grasps and the object that is grasped are totally nonexistent so the imaginary mark is no mark, hence all are the same insofar as they have no mark.

source: །དོན་དམ་པར་ཡོངས་སུ་གྲུབ་པའི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་ནི། བདག་ཉིད་ཀྱིས་སྐྱེ་བ་ཡང་མེད་ལ་རྒྱུ་དང་རྐྱེན་རྣམས་ཀྱིས་བསྐྱེད་པ་ཡང་མེད་དེ། དེ་བས་ན་མ་སྐྱེས་པར་མཉམ་པ་ཉིད་དང་། འབྱུང་བ་མེད་པར་མཉམ་པ་ཉིད་དོ།
en: The ultimate thoroughly established nature is not produced from itself and is not produced from causes and conditions, hence there is an unproduced sameness, and an unoriginated sameness.

source: །དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་དེ་ནི་ཉོན་མོངས་པའི་ཀུན་ནས་ཉོན་མོངས་པ་དང་བྲལ་བའི་ཕྱིར་དང་སྐྱེ་བའི་ཀུན་ནས་ཉོན་མོངས་པ་དང་བྲལ་བའི་ཕྱིར་རོ། །ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་ཀྱིས་དབེན་པ་སྟེ། དེ་བས་ན་དབེན་པར་མཉམ་པ་ཉིད་དོ།
en: The nature of suchness is free from afflictions and defilements, and free from the defilement of birth, therefore all phenomena are essentially isolated, hence there is an isolated sameness.

source: །ཡོངས་སུ་གྲུབ་པའི་ངོ་བོ་ཉིད་དེ་ནི་སྔོན་ནས་སྐྱེ་བ་མེད་པའི་ཕྱིར་དང་། ཐ་མར་འགག་པ་མེད་པའི་ཕྱིར། ཆོས་ཐམས་ཅད་སྐྱེས་པ་མེད་པ་དང་། འགགས་པ་མེད་པ་སྟེ། དེ་བས་གཟོད་མ་ནས་ཞི་བར་མཉམ་པ་ཉིད་དོ།
en: The nature of suchness is not produced earlier and does not cease at the end, so all phenomena are unproduced and unceasing, hence there is a calm-from-the-beginning sameness.

source: །དོན་དམ་པའི་ངོ་བོ་ཉིད་དེ་ལ་འཛིན་པ་ནི་ཡང་དག་པའི་ཡེ་ཤེས་སྤྲོས་པ་མེད་པ་ཡིན་ཏེ། དེའི་གཟུང་བ་ཡིན་པའི་ཕྱིར།
en: The subject of that ultimate nature is unelaborated perfect knowledge because it has that as its object.

source: ཆོས་ཐམས་ཅད་ཀྱང་སྤྲོས་པ་མེད་པ་ཞེས་བྱ་སྟེ། དེ་ལྟ་བས་ན་སྤྲོས་པ་མེད་པར་མཉམ་པ་ཉིད་དོ།
en: All phenomena are unelaborated, hence there is an unelaborated sameness.

source: །དོན་དམ་པའི་ངོ་བོ་ཉིད་དེ་ནི་བྱེད་པ་མེད་པའི་ཕྱིར་དོན་དམ་པར་ན་འགྲོ་བ་གཞན་དང་ཕུང་པོ་གཞན་པ་གཏོང་བ་དང་།
en: That ultimate nature is unmade.

source: ཕུང་པོ་གཞན་ལེན་པ་མེད་དེ།
en: Ultimately there is no forsaking of one form of life and one set of aggregates and appropriating another set of aggregates.

source: དོན་དམ་པར་དེ་ལྟར་ལེན་པ་དང་། ཡོངས་སུ་འདོར་བ་མེད་པའི་ཕྱིར་བླང་བ་མེད་པ་དང་། དོར་བ་མེད་པར་མཉམ་པ་ཉིད་དོ།
en: So, because there is no forsaking or appropriating, there is a no forsaking or appropriating sameness.

source: །ཀུན་བརྟགས་པ་དེ་དག་ནི་གཉིས་ཀྱི་བདག་ཉིད་ཀྱིས་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར་སྒྱུ་མ་ལ་སོགས་པ་དང་མཚུངས་པས་སྒྱུ་མ་ལ་སོགས་པར་མཉམ་པ་ཉིད་དོ། །ཡོངས་སུ་གྲུབ་པའི་ངོ་བོ་ཉིད་ནི་ཀུན་བརྟགས་པའི་དངོས་པོའི་ངོ་བོ་ཉིད་དུ་ཡང་མེད་ལ།
en: Those imaginaries do not have an intrinsic nature that is dual in nature, so they are similar to an illusion and so on, hence there is a sameness as an illusion and so on.

source: རི་བོང་གི་རྭ་ལ་སོགས་པ་བཞིན་དུ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་ཡང་མེད་དེ།
en: The thoroughly established nature does not exist as a falsely imagined existent nature and is not something nonexistent like a rabbit’s horns and so on either.

source: དེ་བས་ན་གཉིས་སུ་མེད་པའི་ཕྱིར་དངོས་པོ་དང་དངོས་པོ་མེད་པ་མཉམ་པ་ཉིད་ཡིན་པར་ཤེས་པར་བྱ་སྟེ།
en: Therefore, it is neither, hence there is an existent and nonexistent sameness.

source: དེ་ལྟར་མཉམ་པ་ཉིད་ཀྱི་མཚན་ཉིད་རྣམ་པ་བཅུ་རྟོགས་པས་ཆོས་ཐམས་ཅད་ལ་མཉམ་པ་ཉིད་ཀྱི་བཟོད་པ་ཐོབ་པ་ཞེས་བྱའོ།
en: Because they thus realize the ten marks of sameness, they had acquired forbearance for the sameness of all dharmas.

source: །དེ་ལྟར་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་གྱི་ཏིང་ངེ་འཛིན་དག་ལ་ལེགས་པར་གནས་ཤིང་མཉམ་པ་ཉིད་ཀྱི་ཆོས་བཅུ་རྟོགས་པ་དང་ལྡན་པ་དེ་སེམས་ཅན་རྣམས་མགོན་མེད་པར་མཐོང་ནས་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་མངོན་པར་སྐྱེས་ཏེ།
en: Those dwelling in the three meditative stabilizations that are gateways to liberation, endowed with a realization of the tenfold sameness, behold beings without a protector and feel great compassion for them.

source: དེ་ལྟར་དོན་དམ་པ་ལ་མཁས་པ་དེ་གང་གི་ཚེ་མྱ་ངན་ལས་འདས་པ་ལ་གཞོལ་བར་གྱུར་པ་དེའི་ཚེ། སྙིང་རྗེས་ཟིན་པས་འཁོར་བ་ལ་མངོན་དུ་ཕྱོགས་པར་མཛད་དོ།
en: Thus, those learned in the ultimate are yet seized by compassion and confront cyclic existence when they are inclined toward nirvāṇa.

source: །འདི་ལྟར་ཤེས་རབ་ཀྱིས་འཁོར་བ་མི་ལེན་ཅིང་། མྱ་ངན་ལས་འདས་པ་ལ་མངོན་དུ་ཕྱོགས་པའི་སེམས་སུ་གྱུར་ལ། སྙིང་རྗེས་མྱ་ངན་ལས་འདས་པ་མི་ལེན་ཅིང་འཁོར་བ་ལ་མངོན་དུ་ཕྱོགས་པར་སྦྱོར་བ་དེ་ལ། ས་བཅུ་པ་ལས་བཤད་པའི་རིམ་པ་བཞིན་དུ་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་འདི་འབྱུང་བར་འགྱུར་ཏེ།
en: And so those who avoid cyclic existence and mentally confront nirvāṇa with the practice of wisdom, and avoid nirvāṇa and confront cyclic existence with the practice of compassion, gradually, as explained in The Ten Bhūmis, come to have a proper way of paying attention.

source: རང་བཞིན་གྱིས་ཉམ་ཆུང་བ་བདག་གི་དང་བྲལ་བའི་འདུས་བྱས་འདི་ནི་ཉོན་མོངས་པ་དང་ལྡན་པའི་ཕྱིར་དང་། རྐྱེན་ཚོགས་པ་ལས་འབྱུང་གི་ཉོན་མོངས་པ་དང་མི་ལྡན་ཞིང་རྐྱེན་ཚོགས་པ་མེད་པར་ནི་འབྱུང་བར་མི་ནུས་སོ།
en: This naturally weak and unowned compounded aggregate comes about because of possessing afflictions, and conditions being complete, but it cannot come about when there is no possession of afflictions and when conditions are not complete.

source: །དེ་ལྟ་བས་ན་བདག་གིས་ཉོན་མོངས་པ་དང་ལྡན་པ་དང་། རྐྱེན་ཚོགས་པ་མེད་པར་ནི་བྱའི། མགོན་མེད་པའི་སེམས་ཅན་རྣམས་ཆུད་ཟོས་སུ་འོང་བས་སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་པའི་ཕྱིར་འདུས་བྱས་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་རྣམ་པར་ཞི་བར་ནི་མི་བྱའོ་སྙམ་མོ།
en: Hence they think, “I have to make possession of the afflictions and completion of the conditions nonexistent; but beings who have no protector would then come to be ignored, so, in order to be of benefit to beings, I should not completely and totally put an end to the compounded aggregate.”

source: །དེ་ལྟར་ཤེས་རབ་དང་། སྙིང་རྗེ་དང་ལྡན་ཞིང་ཡིད་ལ་བྱེད་པ་འདི་ལ་གནས་པ་དེ་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ཆགས་པ་མེད་པ་ཞེས་བྱ་བ་སྣང་བའི་ཚུལ་དུ་མངོན་དུ་འགྱུར་ཏེ།
en: In regard to those endowed with such wisdom and compassion dwelling in this attention, they actualize by way of appearance “standing unattached in the perfection of wisdom.”

source: ཤེས་པ་འདི་ནི་སྤྱོད་པ་དང་རྗེས་སུ་མཐུན་པའི་བཟོད་པ་ཞེས་བྱའོ།
en: This knowledge is “forbearance conforming to the practice.”

source: །དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པས་སྣང་བར་བྱ་བ་ཆགས་པ་མེད་པར་གནས་པའི་མཚན་ཉིད་གཟུངས་ཤེས་པ་འདི་ལ་ཤིན་ཏུ་གནས་པ་དེ་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ཀྱང་བྱེད་ལ། དེ་ལ་ཡང་ཆགས་པ་མེད་པར་སྤྱོད་དོ།
en: Thus standing in the perfection of wisdom, an appearance marked by standing without attachment, standing completely in this dhāraṇī knowledge, they even rule as wheel-turning emperors for the sake of beings, even as they pursue life without attachment.

source: །འདོད་པ་ལ་ཀུན་ཏུ་སྤྱོད་པ་མང་པོ་ཡང་སྟོན་ལ། དེ་ལ་ཡང་ཆགས་པ་མེད་པར་སྤྱོད་དོ།
en: They demonstrate many types of enjoyment of sense pleasures, again doing so without attachment to them.

source: །འཇིག་རྟེན་པའི་ཡོ་བྱད་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ཀྱང་སེམས་ཅན་གྱི་དོན་དུ་{སྩོགས་,སོགས་}ལ་དེ་ལ་ཡང་ཆགས་པ་མེད་དོ།
en: They accumulate a wealth of worldly belongings for the sake of beings, without attachment to them.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱང་བསྒོམས་ལ་མྱ་ངན་ལས་འདས་པ་ལ་ཡང་ཆགས་པ་མེད་པར་བསྒོམ་མོ།
en: They cultivate the thirty-seven dharmas on the side of awakening, cultivating them without attachment to nirvāṇa.

source: །དེ་བཞིན་ཉིད་འདུས་མ་བྱས་ཀྱང་བསྒོམས་ལ། དེ་ལ་ཡང་ཆགས་པ་མེད་པར་བསྒོམ་མོ།
en: They meditate on uncompounded suchness, again meditating without attachment to it.

source: །དེ་ལྟར་ཐབས་མཁས་པ་གཙོ་བོར་བྱེད་པ་དེ་གཟུངས་ཤེས་པའི་ཁྱད་པར་ཐོབ་པས། ཆགས་པ་མེད་པའི་གཟུངས་ཐོབ་པ་ཞེས་བྱའོ།
en: Because they have thus acquired the special knowledge of dhāraṇī that makes such skillful means paramount, they are those who had acquired the dhāraṇī of nonattachment.

source: །དེ་ལྟར་ཆགས་པ་མེད་པར་གནས་པ་ལ་གནས་ནས་འཁོར་བ་དང་། མྱ་ངན་ལས་འདས་པ་གཉིས་མཉམ་པར་སེམས་པ་དེ་སེམས་ཅན་གྱི་དོན་འབའ་ཞིག་ལ་རྣམ་པ་ཐམས་ཅད་དུ་རྩོལ་བ་ན་སེམས་ཅན་རྣམས་ལ་ཕན་པར་བྱ་བའི་ཕྱིར། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་མཉམ་པར་འཇོག་ཀྱང་དེའི་དབང་གིས་སྐྱེ་བ་མི་ལེན་གྱི།
en: When they thus stand by standing without attachment, thinking that both cyclic existence and nirvāṇa are the same, exerting themselves totally for the sake of beings alone, they enter into the concentrations, deliverances, meditative stabilizations, and absorptions in order to help beings, but they do not take birth through their force.

source: བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དེ་དག་སེམས་ཅན་རྣམས་ལ་ཕན་པར་བྱ་བའི་དོན་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བར་མཛད་དོ། །དེ་ལྟར་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་དེ་དག་ཡོངས་སུ་བསྔོས་ནས་སེམས་ཅན་རྣམས་ཀྱི་དོན་ཉིད་དུ་འདི་ལྟ་སྟེ།
en: They transform those concentrations, deliverances, meditative stabilizations, and absorptions into just what will be of help to beings.

source: རྫུ་འཕྲུལ་བྱ་བ་ཤེས་པ་དང་། ལྷའི་མིག་དང་། ལྷའི་རྣ་བ་དང་། སེམས་ཀྱི་རྣམ་གྲངས་ཤེས་པ་དང་། སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་ཤེས་པ་དང་། ཟག་པ་ཟད་པ་ཤེས་པ་མངོན་སུམ་དུ་བྱེད་པའི་ཤེས་པ་དང་། མངོན་པར་ཤེས་པ་དྲུག་བསྐྱེད་དོ།
en: Having thus transformed them for the sake of beings they produce the six clairvoyances: knowledge of the performance of miraculous powers, the divine eye, the divine ear, knowledge of the ways of thinking, knowledge that recollects previous existences, and knowledge that makes directly known the extinction of outflows.

source: །དེ་ལ་རྫུ་འཕྲུལ་བྱ་བ་ཤེས་པ་ནི་རྣམ་པ་གཉིས་ཏེ་ཡོངས་སུ་བསྒྱུར་བ་དང་། སྤྲུལ་པའོ། །དེ་ལ་ཡོངས་སུ་བསྒྱུར་བ་ཞེས་བྱ་བ་ནི། གཡོ་བར་བྱ་བ་དང་། འབར་བར་བྱ་བ་དང་།
en: Among these, knowledge of the performance of miraculous powers is of two types: transformative and magically creative.

source: ཆར་འབབ་པར་བྱ་བ་དང་། ཁྱབ་པར་བྱ་བ་དང་། དངོས་པོ་གཞན་དུ་བསྒྱུར་བར་བྱ་བ་དང་། འགྲོ་བ་དང་། འོང་བ་དང་། བསྡུ་བ་དང་། རྒྱས་པར་བྱ་བ་དང་། གཟུགས་ཐམས་ཅད་ལུས་ཀྱི་ནང་དུ་ཞུགས་པ་དང་། བསྐལ་པ་མཐུན་པའི་དྲུང་དུ་འགྲོ་བ་དང་།
en: Among these, the transformative is causing the act of [the earth] moving, the act of [fire] burning, the act of the rain raining, and the act of [space] being pervasive; the act of changing one thing into something else; going, coming [through walls, etc.],

source: སྣང་བར་བྱ་བ་དང་། མི་སྣང་བར་བྱ་བ་དང་། དབང་དུ་བྱ་བ་དང་། ཕ་རོལ་པོའི་རྫུ་འཕྲུལ་ཟིལ་གྱིས་མནན་པ་དང་། སྤོབས་པ་སྦྱིན་པ་དང་། དྲན་པ་སྦྱིན་པ་དང་། བདེ་བ་སྦྱིན་པ་དང་།
en: shrinking or expanding; swallowing any physical object; appearing before anyone suitable, the act of appearing, the act of disappearing, or the act of controlling; eclipsing an opponent’s miraculous powers; and giving confidence, giving recollection, giving happiness, giving light, and anything else like those.

source: འོད་གཏོང་བ་ལ་སོགས་པ་གཞན་ཡང་དེ་དང་འདྲ་བ་དག་སྟེ། སེམས་ཅན་རྣམས་ལ་གང་དང་གང་དགོས་པ་དེ་དང་དེ་བྱང་ཆུབ་སེམས་དཔའ་དེས་སྒྲུབ་པོ།
en: The bodhisattvas do whatever beings require.

source: །སྤྲུལ་པ་ཞེས་བྱ་བ་ནི། སྤྲུལ་པ་རྣམ་པ་གསུམ་སྟེ། ལུས་སྤྲུལ་པ་དང་། ངག་སྤྲུལ་པ་དང་། ཡུལ་སྤྲུལ་པའོ།
en: As for the magically creative, they are of three types: magically created bodies, magically created speech, and magically created objects.

source: །དེ་ལ་ལུས་སྤྲུལ་པ་ནི་གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་རྣམས་ཀྱི་དོན་གྱི་ཆེད་དུ། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། དྲི་ཟ་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་ཁ་དོག་དང་། མིའི་ཁ་དོག་དང་། དུད་འགྲོ་དང་། {ཡི་དགས་,ཡི་དྭགས་}དང་། སེམས་ཅན་དམྱལ་བའི་ཁ་དོག་དང་། ཉན་ཐོས་ཀྱི་ཁ་དོག་དང་།
en: Among them, magically created bodies are any of the many types of magical creations that bodhisattvas demonstrate for the sake of beings: the appearances of gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, animals, ghosts, and hell beings, and of śrāvakas, pratyekabuddhas, bodhisattvas, and buddhas.

source: རང་སངས་རྒྱས་ཀྱི་ཁ་དོག་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཁ་དོག་དང་། སངས་རྒྱས་ཀྱི་ཁ་དོག་ཏུ་སྤྲུལ་པ་རྣམ་པ་དུ་མ་སྟོན་ཅིང་། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་གྲངས་མེད་པ་རྣམས་སུ་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་རྣམས་ཀྱི་དོན་དུ་སྐད་ཅིག་གཅིག་ལ་ཅིག་ཅར་དུ་ཁ་དོག་སྣ་ཚོགས་པའི་སྤྲུལ་པ་དེ་དག་གིས་བསྒྲུབས་པའོ།
en: They succeed in magically creating these different appearances for the sake of an infinite, incalculable number of beings instantaneously and simultaneously in an infinite, incalculable number of worlds in the ten directions.

source: །ངག་སྤྲུལ་པ་གང་ཞེ་ན། འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ཉན་ཐོས་དང་།
en: What is magically created speech?

source: བྱང་ཆུབ་སེམས་དཔའི་འཁོར་འདུས་ཤིང་འཁོད་པ་དཔག་ཚད་ཁོ་ར་ཁོར་ཡུག་གི་དཀྱིལ་འཁོར་ནས། སྟོང་སྤྱི་ཕུད་དང་། སྟོང་གཉིས་དང་། སྟོང་གསུམ་དང་། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་པ་གྲངས་མེད་པ་རྣམས་ཀྱི་བར་དུ་སྤྲུལ་པའི་སྒྲས་གོ་བར་མཛད་པ་དང་།
en: Here bodhisattvas make magically created sounds that are heard by gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, śrāvakas, and bodhisattvas assembled and arrayed as a retinue within the encircling girdle of mountains, up to as far away as the first thousandfold world system, the millionfold and the billionfold world systems, and an infinite, incalculable number of worlds in the ten directions.

source: སྒྲ་དེ་དག་ལས་ཀྱང་སེམས་ཅན་རྣམས་ལ་ཆོས་བསྟན་པ་རྣམ་པ་དུ་མ་མཛད་པའམ།
en: With those sounds they teach the Dharma to all beings in many ways.

source: སྤྲུལ་པ་གཞན་དག་གིས་བྱེད་དུ་འཇུག་པར་མཛད་པ་དང་། ནམ་མཁའ་ལས་ཀྱང་ཆོས་སྟོན་པའི་སྒྲ་འབྱིན་ཅིང་ཡུལ་སྣ་ཚོགས་ན་མོས་པ་རྣམས་ལ་བསྐུལ་བར་མཛད་པའོ།
en: With other magical creations they set them to work, cause the sky to emit the sound of Dharma teachings, and exhort those who incline toward various objects.

source: །ཡུལ་སྤྲུལ་པ་གང་ཞེ་ན།
en: What are magically created objects?

source: ཡོ་བྱད་ཀྱིས་ཕོངས་པའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བཟའ་བ་དང་། བཏུང་བ་དང་། བཞོན་པ་དང་། གོས་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་།
en: For the sake of poverty-stricken beings, bodhisattvas magically create food, drink, transportation, clothes, jewels, pearls, vaiḍūrya, and so on.

source: བཻ་ཌཱུརྱ་ལ་སོགས་པའི་སྤྲུལ་པ་སྤྲུལ་པར་མཛད་དེ། ཇི་སྟེ་དེའི་ཚེ་ཙམ་ཞིག་ཏུ་དགོས་པར་གྱུར་ན་ཡང་དེའི་ཚེ་ཙམ་ཉིད་དུ་འགྱུར་རོ། །ཅི་སྟེ་གང་གི་ཚེ་དེ་བདེན་པ་ཉིད་དུ་བྱིན་གྱིས་རློབ་ན་ཡང་དུས་ཇི་སྲིད་པ་ཉིད་དུ་འགྱུར་རོ།
en: To the extent they are needed, to that extent they come about, lasting as long as the power sustaining their truth is exerted.

source: །དེ་ལྟར་རྫུ་འཕྲུལ་བྱ་བ་ཤེས་པས་ཕན་འདོགས་སོ།
en: Thus, through their knowledge of miraculous powers they help beings.

source: །རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་གྱིས་སེམས་ཅན་རྣམས་འདུན་པར་མཛད་ནས། སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་འཇུག་པར་མཛད་དོ།
en: Having motivated them with miraculous wonder-working powers, they introduce them to Buddhist doctrine.

source: །ཡང་ན་སེམས་ཅན་སྡུག་བསྔལ་བ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཕན་འདོགས་པར་མཛད་པའོ།། །།བམ་པོ་གཉིས་པ།
en: And they also help suffering beings in many other ways.

source: །སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་ཤེས་བཞེས་པས་ནི་སེམས་ཅན་རྣམས་ཀྱི་སྔོན་གྱི་སྤྱོད་པ་རྣམས་རྗེས་སུ་དྲན་ནས་དེ་དང་མཐུན་པ་མཁྱེན་ཏེ། ཆོས་བསྟན་པ་ལ་སོགས་པ་མཛད་དོ།
en: With knowledge that recollects previous existences they recollect the earlier behavior of beings, know what agrees with them, and teach them Buddhist doctrine.

source: །ཡང་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཆོག་ཏུ་རྨད་དུ་བྱུང་བའི་སྤྱོད་པ་དྲན་ནས། སེམས་ཅན་རྣམས་དད་པ་ཡང་དག་པར་བསྐྱེད་པའི་ཕྱིར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །རྟག་པར་སྨྲ་བ་དང་།
en: Alternatively, they recollect the supreme, marvelous behavior of bodhisattvas and demonstrate it perfectly, to perfectly engender faith in beings.

source: ཆད་པར་སྨྲ་བ་རྣམས་ལ་སྔོན་གྱི་ཚུལ་ཉེ་བར་བསྟན་ནས། ལྟ་བ་རྣམ་པར་འཇིག་པར་བྱེད་དོ།
en: They demonstrate to proponents of eternalism and nihilism what happened previously and destroy their views.

source: །དེ་ཤེས་པ་དེས་བདག་ཉིད་ཀྱི་སྔོན་གྱི་གནས་ཀྱང་དྲན་ནོ། །གཞན་དག་གི་སྔོན་གྱི་སྲིད་པ་ཡང་དྲན་ནོ། །ཡང་གཞན་དག་གི་སྔོན་གྱི་སྲིད་པ་དེ་དག་ཉིད་ཀྱི་རྗེས་སུ་དྲན་པར་མཛད་པའོ། །ལྷའི་རྣ་བས་ནི་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོ་དང་།
en: With that knowledge they recollect their own previous existences; they also recollect the previous suffering existences of others, and they also cause others to recollect their previous suffering existences.

source: ཡི་དྭགས་དང་། མི་རྣམས་ཀྱི་ནང་དུ་སེམས་ཅན་སྡུག་བསྔལ་བ་རྣམས་ཀྱི་ཉམ་ཐག་པའི་སྒྲ་གསན་ནས། དེ་དག་གི་སྡུག་བསྔལ་བསལ་བའི་ཕྱིར་འབད་པར་མཛད་དོ། །ཡང་ན་སངས་རྒྱས་ཀྱི་ཞིང་སྣ་ཚོགས་སམ། འདི་ཉིད་ན་ཆོས་བསྟན་པ་ཐ་དད་པ་གང་ཡིན་པ་དེ་དག་གསན་ཏོ།
en: With their divine ear they hear the pitiful sounds of suffering beings in hell, among the animals, the ghosts, and humans, and work to relieve their pains; or they hear different Dharma teachings in various buddhafields, or right here; or they hear many different sounds urging them on.

source: །ཡང་ན་ཡང་དག་པར་བསྐུལ་བའི་སྒྲ་རྣམ་པ་དུ་མ་གསན་ཏོ། །ལྷའི་མིག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཕྱོགས་བཅུའི་སེམས་ཅན་རྣམས་ཀྱི་དགེ་བ་དང་མི་དགེ་བའི་སྤྱོད་པ་རྣམས་སྣ་ཚོགས་པ་གཟིགས་ནས་ཅི་རིགས་པར་སྒྲུབ་པར་མཛད་དོ།
en: With their divine eye bodhisattvas see the variety of wholesome and unwholesome behaviors of beings in the ten directions and do what is appropriate.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་དང་དེ་དག་ན་དེ་བཞིན་གཤེགས་པ་འཁོར་མང་པོའི་ནང་ན་ཆོས་སྟོན་པ་ཡང་གཟིགས་སོ།
en: They also behold many teachings of Dharma in many retinues of tathāgatas in the many different buddhafields.

source: །ཕ་རོལ་གྱི་སེམས་ཤེས་པས་ནི་གཞན་དག་གི་འདོད་ཆགས་དང་། ཞེ་སྡང་ལ་སོགས་པ་དང་མཚུངས་པར་ལྡན་པའི་སེམས་རྣམས་མཁྱེན་ནས། དེ་དག་ལ་ཅི་རིགས་པར་སྒྲུབ་པར་མཛད་དོ།
en: With knowledge of others’ thoughts they know others’ greed, hatred, and so on accompanying their thoughts and do what is appropriate.

source: །སེམས་ཅན་རྣམས་ཀྱི་དབང་པོ་དང་། སྤྱོད་པ་དང་། ཁམས་དང་། བག་ལ་ཉལ་བ་ལ་སོགས་པ་ཐ་དད་པ་རྣམས་མཁྱེན་ནས་ཅི་རིགས་པར་ཆོས་སྟོན་ཏོ།
en: They know the different faculties, behaviors, dispositions, propensities, and so on of beings and teach the Dharma appropriately.

source: །ཟག་པ་ཟད་པ་ཤེས་པས་ནི་བྱང་ཆུབ་སེམས་དཔའ་བདག་གམ་གཞན་དག་གི་ཉོན་མོངས་པ་ཟད་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏེ། བདག་གི་ཉོན་མོངས་པ་ཟད་པ་ཐོབ་པ་འམ། མ་ཐོབ་པའམ། གཞན་དག་གི་ཉོན་མོངས་པ་ཟད་པ་ཐོབ་པའམ། མ་ཐོབ་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: With knowledge of the extinction of outflows bodhisattvas know perfectly and properly that their own and others’ afflictions are extinguished, and they know perfectly and properly whether or not they have attained the extinction of their own afflictions, and whether or not others have attained the extinction of their afflictions.

source: །བདག་དང་གཞན་དག་གི་ཉོན་མོངས་པ་ཟག་པ་ཟད་པར་བྱ་བའི་ཐབས་དང་། ཐབས་མ་ཡིན་པ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ།
en: They also know perfectly what is and is not the means to extinguish their own and others’ afflictions and outflows.

source: །གཞན་དག་གི་ཉོན་མོངས་པ་ཟད་པ་ཐོབ་པའི་མངོན་པའི་ང་རྒྱལ་དང་། བདེན་པ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ།
en: They know perfectly whether others’ attainment of the extinction of outflows is an unfounded conceit or is true.

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་རབ་ཏུ་མཁྱེན་ནས། དེ་ལ་བདག་ཉིད་ཀྱིས་ཟག་པ་ཟད་པ་མངོན་སུམ་དུ་མཛད་དོ།
en: Perfectly knowing all that, bodhisattvas themselves realize the extinction of outflows.

source: །ཟག་པ་དང་བཅས་པའི་དངོས་པོ་དང་། ཟག་པ་མེད་པ་ཡང་རབ་ཏུ་མཁྱེན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ཟག་པ་ཟད་པའི་ཤེས་པ་དེ་ཉིད་ཀྱིས་ཟག་པ་དང་བཅས་པའི་ཉོན་མོངས་པའི་ཆོས་ཐམས་ཅད་དང་ལྷན་ཅིག་གནས་ཀྱང་བདག་ཉིད་ཀུན་ནས་ཉོན་མོངས་པར་མི་འགྱུར་རོ།
en: Bodhisattvas know perfectly things with and without outflows, and with just the knowledge of the extinction of outflows they stay together with all the afflicted dharmas with outflows, without themselves becoming defiled.

source: །མངོན་པར་ཤེས་པ་དྲུག་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཚེ་རབས་ཚེ་རབས་སུ་ཡོད་པར་གྱུར་ཏོ།
en: Bodhisattvas have these six clairvoyances in lifetime after lifetime.

source: །དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེས་པ་ན་ཡང་ཉམས་པར་མི་འགྱུར་བས་ན་མངོན་པར་ཤེས་པ་མ་ཉམས་པ་ཞེས་བྱའོ།
en: Even when they are reborn as animals they do not lose them, so they are with imperishable clairvoyant knowledges.

source: །དེ་ལྟར་མངོན་པར་ཤེས་པ་དྲུག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་པ་ཉིད་ཀྱི་ཕྱིར་འབད་དོ། །ཕན་གདགས་པའི་སེམས་ཅན་དེ་དག་ཀྱང་ལྷན་ཅིག་སྐྱེས་པའི་དགའ་བས་བྱང་ཆུབ་སེམས་དཔའི་ངག་ཉན་པར་འགྱུར་ཏེ།
en: Bodhisattvas who have these six clairvoyances make an effort to help beings, and those beings they have helped experience a simultaneously arising pleasure, so they listen to the bodhisattva’s speech.

source: དེས་གདམས་པ་དང་། རྗེས་སུ་བསྟན་པ་ལས་སྲོག་གི་ཕྱིར་ཡང་འགལ་བར་མི་བྱེད་དོ།
en: Even at the cost of their life they do not go against the advice and instruction.
